Revit 2027 API
ExtElemChangeBeamSectionRegistry Class
 An object that stores IExtElemChangeBeamSection
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.ExtElemChangeBeamSectionRegistry
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExtElemChangeBeamSectionRegistry : IDisposable
Public Class ExtElemChangeBeamSectionRegistry
	Implements IDisposable
public ref class ExtElemChangeBeamSectionRegistry : IDisposable
type ExtElemChangeBeamSectionRegistry =
    class
        interface IDisposable
    end
The ExtElemChangeBeamSectionRegistry type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ExtElemChangeBeamSectionRegistry
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
RegisterInterface |  Registers a IExtElemChangeBeamSection
ToString | Returns a string that represents the current object.
(Inherited from Object)
Unregister |  Unregisters IExtElemChangeBeamSection.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace